app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show # students#show controller will search for a file of show.html.erb to RENDER this method
    @student = Student.find(params[:id])